# กรณีที่ 1 print() มีข้อมูลหลายประเภททำไง????? มี่ 4 วิธี 
print('hello',555,'wow',999,True,'Hi',10 + 20 -5,152.875)

# วิธีที่ 2 ใช้ + (ข้อมูลใหนที่ไม่ใฃ้ sting ต้องทำให้เป็น sting ใช้ฟังก์ชัน str()) 
# 
print('hello'+str(555)+'wow'+str(999)+str(True)+'Hi'+str(10 + 20 -5)+str(152.875))
print('hello'+str(555)+'wow'+str(999)+str(True)+'Hi'+str(10 + 20 -5)+'True'+'Hi'+'25'+(152.875))

# วิธีที่ 3 ใช้เมธอค format() โดยข้อมูลที่แสดงอยู่ในรูปของ sting
# (ข้อมูลที่ไม่ใช่ sting ให้ใส่ใน ()ของ format และตำแหน่งที่แสดงข้อมูลนั้นให้ได้ {} แทน)
print('hello {} wow {} {} Hi {} {} {}'.format(555,999,True,10+20-5,152.875,25))

# index number  0  1  2  3  4
print('(2) (4)'.format('a','b','c','d','e'))