# โปรแกรมซึ่งรับชื่อ และปีเกิดของผู้ใช้โปรแกรมทางแป้นพิมพ์ โดยหากอายุที่ผู้ใช้ป้อนมีค่าตั้งแต่ 35 ปีขึ้นไป ให้แสดงข้อความว่า "คุณแก่แล้ว..." หากไม่ถึงให้แสดงข้อความ "คุณยังไม่แก่..." ทางหน้าจอ

from datetime  import datetime

bus_line = input("กรุณาป้อนสายรถเมล์: ")

if bus_line == "3":
    print("สาย 3 ไปสนามหลวง ลาดพร้าว")
elif bus_line == "71":
    print("สาย 71 ไปหัวลำโพง เยาวราช")
elif bus_line == "56":
    print("สาย 56 ไปบางลำพู สะพานกรุงธน")
elif bus_line == "539":
    print("สาย 539 ไปอนุสาวรีย์ชัย สามเสน")
else:
    print("ยังไม่มีข้อมูลสายรถเมล์ที่สอบถาม")

print('-----------------------------------')
print('ขอบคุณที่ใช้บริการ')
print('-----------------------------------')