# สร้างโปรแกรมคำนวณเงินเดือนสุทธิที่ต้องจ่ายหลังจากหักภาษีแล้ว 7% ของเงินเดือน  และหักค่าประกันสังคม 3% ของเงินเดือน
# โดยรับค่ารหัสพนักงาน ชื่อพนักงาน เงินเดือน ทางแป้นพิมพ์ และแสดงผลข้อมูลที่รับมา
# พร้อมกับรายละเอียดว่าต้องเสียภาษีกี่บาท หักค่าประกันสังคมกี่บาท และต้องจ่ายเงินเดือนสุทธิกี่บาท
print('+++++++++++++++++++++++++++++++++++')
print(' โปรแกรมคำนวณเงินเดือน')
print('+++++++++++++++++++++++++++++++++++')
emp_code = input('ป้อนรหัสพนักงาน: ')
emp_name = input('ป้อนชื่อพนักงาน: ')
emp_salary = input('ป้อนเงินเดือน: ')
print('+++++++++++++++++++++++++++++++++++')
tax = float( emp_salary ) * 0.07
insurance = float( emp_salary ) * 0.03
emp_salary_net = float( emp_salary ) - tax - insurance
print(f'รหัส: {emp_code} ชื่อ: {emp_name} เงินเดือน {emp_salary}')
print(f'หักภาษี {tax} บาท')
print(f'หักค่าประกันสังคม {insurance} บาท')
print(f'ต้องจ่ายเงินเดือนสุทธิ {emp_salary_net} บาท')
print('+++++++++++++++++++++++++++++++++++')
# ใช้ ,
print("รหัส:" , emp_code ,"ชื่อ:" , emp_name ,"เงินเดือน:" , emp_salary)
print("หักภาษี",tax, "บาท")
print("หักค่าประกันสังคม", insurance , "บาท")
print("ต้องจ่ายเงินเดือนสุทธิ" ,emp_salary_net, "บาท")
print('+++++++++++++++++++++++++++++++++++')
# ใช้ +
print("รหัส:" + emp_code +"ชื่อ:" + emp_name +"เงินเดือน:" + emp_salary)
print("หักภาษี"+str(tax)+ "บาท")
print("หักค่าประกันสังคม"+ str(insurance) + "บาท")
print("ต้องจ่ายเงินเดือนสุทธิ" +str(emp_salary_net)+ "บาท")
print('+++++++++++++++++++++++++++++++++++')
# ใช้ format
print("รหัส: {} ชื่อ: {} เงินเดือน {}".format(emp_code,emp_name,emp_salary))
print("หักภาษี {} บาท".format(tax))
print("หักค่าประกันสังคม {} บาท".format(insurance))
print("ต้องจ่ายเงินเดือนสุทธิ {} บาท".format(emp_salary_net))
print('+++++++++++++++++++++++++++++++++++')