# Assignment Operator กำหนดค่า คือ เครื่องหมาย =
# การทำงานของ = คเอาทางขวาไปใส่ทางซ้าย
# ยกเว้นเสียแต่ว่า สิ่งที่อยู่ทางขวามีการทำงานใดๆ ให้ทำให้เสร็จแล้วเอาผลไปใส่ทางซ้าย
# ตัวแปร (variable) = ข้อมูล (data)/นิพจน์ (expression)
# *** ตัวแปร (variable) คือ ชื่อที่ Dev. ตั้งขึ้นมาเองเอาไว้เก็บข้อมูล ***
# *** การใช้งานตัวแปร คือ เอาข้อมูลไปใส่ในตัวแปร หรือ เอาข้อมูลที่มักเก็บอยู่มาใช้ ***

score = 20
fullname = "theerasak"
salary = input('ป้อนเงินเดือน: ')
sum = 20 + 30
print('---------------------------')
num = 10
num += 10 # num = num + 10 
num -= 10 # num = num - 10
num *= 10 # num = num * 10
num /= 10 # num = num / 10
num %= 10 # num = num % 10
num //= 10 # num = num // 10 
print(num)
print('---------------------------')