#โปรแกรมคำนวณค่าคอมมิชชั่นของพนักงานขาย โดยป้อนรหัสพนักงาน ชื่อพนักงาน และจำนวนเงินซึ่งเป็นยอดขายของพนักงาน จากผู้ใช้ทางแป้นพิมพ์ และคำนวณค่าคอมมิชชั่น จากเงื่อนไข ดังนี้
# ขายของได้ไม่เกิน 1000 บาท ค่าคอมมิชชั่น เป็น 0.0 บาท
#ขายของได้ตั้งแต่ 1001 – 2000  บาท ค่าคอมมิชชั่นคิด 	1% จากยอดขาย
#ขายของได้ตั้งแต่ 2001 – 3000  บาท ค่าคอมมิชชั่นคิด 	3% จากยอดขาย
#ขายของได้ตั้งแต่ 3001  บาท ขึ้นไป ค่าคอมมิชชั่นคิด 	5% จากยอดขาย

print('-----------------------------------')
print('โปรแกรมคอมมิชชั่นของพนักงานขาย')
print('-----------------------------------')
Sale_id = input('ป้อนรหัสพนักงาน : ')
Sale_name = input('ป้อนชื่อพนักงาน : ')
Sale_total = float(input('ป้อนยอดขาย : '))
print('-----------------------------------')
if Sale_total <= 1000:
    print(f'รหัสพนักงาน {Sale_id} ชื่อพนักงาน {Sale_name} ไม่ได้ค่าคอมมิชชั่น')
    print(f'รหัสพนักงาน {Sale_id} ชื่อพนักงาน {Sale_name} ไม่ได้ค่าคอมมิชชั่น'.format(Sale_id, Sale_name))
elif Sale_total > 1000 and Sale_total <= 2000:
    print(f'รหัสพนักงาน {Sale_id} ชื่อพนักงาน {Sale_name} ค่าคอมมิชชั่นคิด 1%')
    print(f'รหัสพนักงาน {Sale_id} ชื่อพนักงาน {Sale_name} ค่าคอมมิชชั่นคิด 1%'.format(Sale_id, Sale_name))
elif Sale_total > 2000 and Sale_total <= 3000:
    print(f'รหัสพนักงาน {Sale_id} ชื่อพนักงาน {Sale_name} ค่าคอมมิชชั่นคิด 3%')
    print(f'รหัสพนักงาน {Sale_id} ชื่อพนักงาน {Sale_name} ค่าคอมมิชชั่นคิด 3%'.format(Sale_id, Sale_name))
elif Sale_total > 3000:
    print(f'รหัสพนักงาน {Sale_id} ชื่อพนักงาน {Sale_name} ค่าคอมมิชชั่นคิด 5%')
    print(f'รหัสพนักงาน {Sale_id} ชื่อพนักงาน {Sale_name} ค่าคอมมิชชั่นคิด 5%'.format(Sale_id, Sale_name))

print('-----------------------------------')
print('ขอบคุณที่ใช้บริการ')
print('-----------------------------------')