# สร้างโปรแกรมคำนวณผลคูณของตัวเลข 2 จำนวนที่รับทางแป้นพิมพ์ แล้วแสดงผลทางหน้าจอ ทั้งนี้โปรแกรมจะทำการคำนวณผลคูณจากตัวเลขที่รับทางแป้นพิมพ์ไปเรื่อยๆ จนกว่าผลคูณจะมากกว่า 5000 ถึงจะหยุดการทำงาน
print('-----------------------------------')
print('โปรแกรมคำนวณผลคูณของตัวเลข')
print('-----------------------------------')

while True :
    Number1 = int(input('ป้อนตัวเลขที่ 1 : '))
    if Number1 == 0 :
        break
    Number2 = int(input('ป้อนตัวเลขที่ 2 : '))
    Result = Number1 * Number2
    print(f'ผลคูณของ {Number1} และ {Number2} คือ {Result}')
    if Result >= 5000 :
        print('เกินค่าที่กําหนด ขอบคุณที่ใช้บริการ')
        break