# Control Flow แบ่งเป็น 2 กลุ่ม / Control statement แบ่งเป็น 2 กลุ่มเช่นกัน
# 1. Selection/Deciston เลือกทำ คือ ต้องพิสูจน์ตรวจสอบก่อนทำงานใดๆ แยกเป็น 3 แบบย่อย
# - พิสูจน์ตรวจสอบครั่งเดี่ยว จริงทำ เท็จไม่ทำ (if)
# - พิสูจน์ตรวจสอบครั่งเดี่ยว จริงทำ เท็จก็ทำ  (if-else)
# - พิสูจน์ตรวจสอบหลายครั่ง              (if-elif-else)

# 2. Loop/Iteration/Repeatition ทำซ้ำ คือ ทำงานเดิมๆ ซ้ำ แยกเป็น 2 แบบ
# - รู้จำนวนครั่วในการทำซ้ำ
# - ไม่รู้จำนวนครั่วในการทำซ้ำ 
# - While, For
# ***สิ่งที่ต้องระวังในการทำซ้ำ คือ ต้องรู้จบ

# *** Statement ทืี่เกี่ยวกับ Control Flow คือคำสั่ง break, continue โดยเฉพาะ Loop 
